project3/DTCHullMoving/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

Lpp	4	;
width	0.4	;
height	0.5	;
Fsheight	0	;
		
		
x_inlet	-9;
x_outlet	12.;
		
z_bottom	-6;
z_top	2	;
		
y_ext	 9;
		

		
x_fore	-0.1;
x_aft	6.2;
y_hull	0.45;
z_1	-0.25	;
z_2	0.35	;
		
		
Nx_hull	126	;
Ny_hull	9	;
Nz_hull	12	;
		
Nx_inlet	30	;
Nx_outlet	40	;
Ny_ext	20	;
Nz_bottom	12	;
Nz_top	10	;
		
Grad_x_in	0.05         ;
Grad_x_out	 4.0  	;
Grad_z_bottom	0.1;
Grad_z_top	 7;
Grad_y	20	;





convertToMeters 1;

vertices
(
    	($x_inlet  0 $z_bottom) //0
	($x_fore   0 $z_bottom) //1
	($x_aft    0 $z_bottom) //2
	($x_outlet 0 $z_bottom) //3
        
        ($x_inlet  $y_hull $z_bottom) //4
	($x_fore   $y_hull $z_bottom) //5
	($x_aft    $y_hull $z_bottom) //6
	($x_outlet $y_hull $z_bottom) //7

        ($x_inlet  $y_ext $z_bottom) //8
	($x_fore   $y_ext $z_bottom) //9
	($x_aft    $y_ext $z_bottom) //10
	($x_outlet $y_ext $z_bottom) //11
	
	($x_inlet  0 $z_1) //12
	($x_fore   0 $z_1) //13
	($x_aft    0 $z_1) //14
	($x_outlet 0 $z_1) //15
        
        ($x_inlet  $y_hull $z_1) //16
	($x_fore   $y_hull $z_1) //17
	($x_aft    $y_hull $z_1) //18
	($x_outlet $y_hull $z_1) //19

        ($x_inlet  $y_ext $z_1) //20
	($x_fore   $y_ext $z_1) //21
	($x_aft    $y_ext $z_1) //22
	($x_outlet $y_ext $z_1) //23

	($x_inlet  0 $z_2) //24
	($x_fore   0 $z_2) //25
	($x_aft    0 $z_2) //26
	($x_outlet 0 $z_2) //27
        
        ($x_inlet  $y_hull $z_2) //28
	($x_fore   $y_hull $z_2) //29
	($x_aft    $y_hull $z_2) //30
	($x_outlet $y_hull $z_2) //31

        ($x_inlet  $y_ext $z_2) //32
	($x_fore   $y_ext $z_2) //33
	($x_aft    $y_ext $z_2) //34
	($x_outlet $y_ext $z_2) //35

	($x_inlet  0 $z_top) //36
	($x_fore   0 $z_top) //37
	($x_aft    0 $z_top) //38
	($x_outlet 0 $z_top) //39
        
        ($x_inlet  $y_hull $z_top) //40
	($x_fore   $y_hull $z_top) //41
	($x_aft    $y_hull $z_top) //42
	($x_outlet $y_hull $z_top) //43

        ($x_inlet  $y_ext $z_top) //44
	($x_fore   $y_ext $z_top) //45
	($x_aft    $y_ext $z_top) //46
	($x_outlet $y_ext $z_top) //47
);

blocks
(


    
    	hex (1 2 6 5 13 14 18 17) 	($Nx_hull $Ny_hull $Nz_bottom) 	simpleGrading (1 1 $Grad_z_bottom)
	hex (13 14 18 17 25 26 30 29) 	($Nx_hull $Ny_hull $Nz_hull) 	simpleGrading (1 1 1)
	hex (25 26 30 29 37 38 42 41) 	($Nx_hull $Ny_hull $Nz_top) 	simpleGrading (1 1 $Grad_z_top)


   	hex (0 1 5 4 12 13 17 16 ) 	($Nx_inlet $Ny_hull $Nz_bottom) 	simpleGrading ($Grad_x_in 1 $Grad_z_bottom)
	hex (12 13 17 16 24 25 29 28) 	($Nx_inlet $Ny_hull $Nz_hull) 	simpleGrading ($Grad_x_in 1 1)
	hex (24 25 29 28 36 37 41 40) 	($Nx_inlet $Ny_hull $Nz_top) 	simpleGrading ($Grad_x_in 1 $Grad_z_top)



   	hex (2 3 7 6 14 15 19 18 ) 	($Nx_outlet $Ny_hull $Nz_bottom) 	simpleGrading ($Grad_x_out 1 $Grad_z_bottom)
	hex (14 15 19 18 26 27 31 30) 	($Nx_outlet $Ny_hull $Nz_hull) 		simpleGrading ($Grad_x_out 1 1)
	hex (26 27 31 30 38 39 43 42) 	($Nx_outlet $Ny_hull $Nz_top) 	simpleGrading ($Grad_x_out 1 $Grad_z_top)


    
    	hex (5 6 10 9 17 18 22 21) 	($Nx_hull $Ny_ext $Nz_bottom) 	simpleGrading (1 $Grad_y $Grad_z_bottom)
	hex (17 18 22 21 29 30 34 33) 	($Nx_hull $Ny_ext $Nz_hull) 	simpleGrading (1 $Grad_y 1)
	hex (29 30 34 33 41 42 46 45) 	($Nx_hull $Ny_ext $Nz_top) 	simpleGrading (1 $Grad_y $Grad_z_top)



   	hex (4 5 9 8 16 17 21 20) 	($Nx_inlet $Ny_ext $Nz_bottom) 	simpleGrading ($Grad_x_in $Grad_y $Grad_z_bottom)
	hex (16 17 21 20 28 29 33 32) 	($Nx_inlet $Ny_ext $Nz_hull) 	simpleGrading ($Grad_x_in $Grad_y 1)
	hex (28 29 33 32 40 41 45 44) 	($Nx_inlet $Ny_ext $Nz_top) 	simpleGrading ($Grad_x_in $Grad_y $Grad_z_top)



   	hex (6 7 11 10 18 19 23 22 ) 	($Nx_outlet $Ny_ext $Nz_bottom) 	simpleGrading ($Grad_x_out $Grad_y $Grad_z_bottom)
	hex (18 19 23 22 30 31 35 34) 	($Nx_outlet $Ny_ext $Nz_hull) 	simpleGrading ($Grad_x_out $Grad_y 1)
	hex (30 31 35 34 42 43 47 46) 	($Nx_outlet $Ny_ext $Nz_top) 	simpleGrading ($Grad_x_out $Grad_y $Grad_z_top)
   

);

edges
(
);

boundary
(
    outlet 
    {
        type outlet;
        faces
        (
            (0 12 16 4)
            (12 24 28 16)
            (24 36 40 28)

            (4 16 20 8)
	    (16 28 32 20)
            (28 40 44 32)
        );
    }


    inlet 
    {
        type inlet;
        faces
        (
            (3 7 19 15)
            (15 19 31 27)
            (27 31 43 39)

            (7 11 23 19)
            (19 23 35 31)
            (31 35 47 43)
            (9 8 20 21)
            (10 9 21 22)
            (11 10 22 23)

            (21 20 32 33)
            (22 21 33 34)
            (23 22 34 35)

	    (33 32 44 45)
            (34 33 45 46)	
            (35 34 46 47)
	    (1 0 4 5)
            (1 5 6 2)
            (2 6 7 3)

            (4 8 9 5)
            (5 9 10 6)
            (6 10 11 7)
        );
    }



    top
    {
        type patch;
        faces
        (
            (36 37 41 40)
            (37 38 42 41)
            (38 39 43 42)
            
           (40 41 45 44)
           (41 42 46 45)
	   (42 43 47 46)
        );
    }

    sideL
    {
        type symmetryPlane;
        faces
        (
            (0 1 13 12)
            (1 2 14 13)
            (2 3 15 14)

            (12 13 25 24)
            (13 14 26 25)
            (14 15 27 26)

            (24 25 37 36)
            (25 26 38 37)
            (26 27 39 38)
        );
    }

);

mergePatchPairs
(
);

// ************************************************************************* //


fromFile true;
